**1. Ubahlah kumpulan data di atas menjadi sebuah kesatuan dataframe**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
series = pd.Series([101621001,101621002,101621003,101216004])
dictionary = {'mata_kuliah':['Kalkulus','Struktur Data','Bahasa Pemrograman I','Basis Data']}
array = np.array([90,80,90,95])
lst = ['Budi','Ira','Bagas','Kusuma']
tpl = (2,3,3,3)

In [ ]:
#Jawaban no.1
df1 = pd.DataFrame(series, columns=['nim'])
df_mk = pd.DataFrame(dictionary)
df_sem = pd.DataFrame(tpl)
df1['nama'] = lst
df1['semester'] = df_sem
df1['mata_kuliah'] = df_mk
df1['nilai'] = array
df1.head()

         nim    nama  semester           mata_kuliah  nilai
0  101621001    Budi         2              Kalkulus     90
1  101621002     Ira         3         Struktur Data     80
2  101621003   Bagas         3  Bahasa Pemrograman I     90
3  101216004  Kusuma         3            Basis Data     95

**2. Buatlah sebuah dataframe dengan metode tipe data awal berupa dictionary**

In [ ]:
Name = ['John', 'Bob', 'Shiela', 'Tokyo']
Education = ['Masters', 'Graduate', 'Graduate', 'Master']
Age = [27, 23, 22, 26]
Gender = ['Male', 'Male', 'Female', 'Female']
Occupation = ['Accountant', 'Technician', 'Art Illustrator', 'Pharmacist']
Salary = ['$ 4,000', '$ 3,500', '$ 2,650', '$ 2,700']

dictionary = {'Name':Name, 'Education':Education, 'Age':Age, 'Gender':Gender, 'Occupation':Occupation, 'Monthly Salary':Salary}
df = pd.DataFrame(dictionary)
df

     Name Education  Age  Gender       Occupation Monthly Salary
0    John   Masters   27    Male       Accountant        $ 4,000
1     Bob  Graduate   23    Male       Technician        $ 3,500
2  Shiela  Graduate   22  Female  Art Illustrator        $ 2,650
3   Tokyo    Master   26  Female       Pharmacist        $ 2,700

In [ ]:
df.dtypes

Name              object
Education         object
Age                int64
Gender            object
Occupation        object
Monthly Salary    object
dtype: object